#
# ᴄᴏᴘʏʀɪɢʜᴛ (ᴄ) 2021-2022 ʙʏ ᴛᴇᴀᴍ Sɪʟᴇɴᴛ@ɢɪᴛʜᴜʙ, < https://github.com/HYPER-AD17/ >.
#
# ᴛʜɪs ꜰɪʟᴇ ɪs ᴘᴀʀᴛ ᴏꜰ < https://github.com/HYPER-AD17/DZ-MUXIC-2.0 > ᴘʀᴏᴊᴇᴄᴛ,
# ᴀɴᴅ ɪs ʀᴇʟᴇᴀsᴇᴅ ᴜɴᴅᴇʀ ᴛʜᴇ "ɢɴᴜ ᴠ3.0 ʟɪᴄᴇɴsᴇ ᴀɢʀᴇᴇᴍᴇɴᴛ".
#
# ᴀʟʟ ʀɪɢʜᴛs ʀᴇsᴇʀᴠᴇᴅ.

HELP_1 = """✅<u>__ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs__:</u>

C sᴛᴀɴᴅs ꜰᴏʀ ᴄʜᴀɴɴᴇʟ ᴘʟᴀʏ.

/pause ᴏʀ /cpause - ᴘᴀᴜsᴇ ᴛʜᴇ ᴘʟᴀʏɪɴɢ ᴍᴜsɪᴄ.
/resume ᴏʀ /cresume - ʀᴇsᴜᴍᴇ ᴛʜᴇ ᴘᴀᴜsᴇᴅ ᴍᴜsɪᴄ.
/mute ᴏʀ /cmute - ᴍᴜᴛᴇ ᴛʜᴇ ᴘʟᴀʏɪɴɢ ᴍᴜsɪᴄ.
/unmute ᴏʀ /cunmute - ᴜɴᴍᴜᴛᴇ ᴛʜᴇ ᴍᴜᴛᴇᴅ ᴍᴜsɪᴄ.
/skip ᴏʀ /cskip - sᴋɪᴘ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀʏɪɴɢ ᴍᴜsɪᴄ.
/stop ᴏʀ /cstop - sᴛᴏᴘ ᴛʜᴇ ᴘʟᴀʏɪɴɢ ᴍᴜsɪᴄ.
/shuffle ᴏʀ /cshuffle - ʀᴀɴᴅᴏᴍʟʏ sʜᴜꜰꜰʟᴇs ᴛʜᴇ ǫᴜᴇᴜᴇᴅ ᴘʟᴀʏʟɪsᴛ.

✅<i>sᴘᴇᴄɪꜰɪᴄ sᴋɪᴘ:</i>
/skip ᴏʀ /skip [ɴᴜᴍʙᴇʀ(ᴇxᴀᴍᴘʟᴇ: 3)] 
    - sᴋɪᴘs ᴍᴜsɪᴄ ᴛᴏ ᴀ ᴛʜᴇ sᴘᴇᴄɪꜰɪᴇᴅ ǫᴜᴇᴜᴇᴅ ɴᴜᴍʙᴇʀ. ᴇxᴀᴍᴘʟᴇ: /sᴋɪᴘ 3 ᴡɪʟʟ sᴋɪᴘ ᴍᴜsɪᴄ ᴛᴏ ᴛʜɪʀᴅ ǫᴜᴇᴜᴇᴅ ᴍᴜsɪᴄ ᴀɴᴅ ᴡɪʟʟ ɪɢɴᴏʀᴇ 1 ᴀɴᴅ 2 ᴍᴜsɪᴄ ɪɴ ǫᴜᴇᴜᴇ.

✅<i>ʟᴏᴏᴘ ᴘʟᴀʏ:</i>
/loop ᴏʀ /cloop [ `enable` / `disable` ] ᴏʀ [ɴᴜᴍʙᴇʀs ʙᴇᴛᴡᴇᴇɴ 1-10] 
    - ᴡʜᴇɴ ᴀᴄᴛɪᴠᴀᴛᴇᴅ, ʙᴏᴛ ʟᴏᴏᴘs ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀʏɪɴɢ ᴍᴜsɪᴄ ᴛᴏ 1-10 ᴛɪᴍᴇs ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ. ᴅᴇꜰᴀᴜʟᴛ ᴛᴏ 10 ᴛɪᴍᴇs.

✅<i>ᴀᴜᴛʜ ᴜsᴇʀs:</i>
ᴀᴜᴛʜ ᴜsᴇʀs ᴄᴀɴ ᴜsᴇ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs ᴡɪᴛʜᴏᴜᴛ ᴀᴅᴍɪɴ ʀɪɢʜᴛs ɪɴ ʏᴏᴜʀ ᴄʜᴀᴛ.

/auth [ᴜsᴇʀɴᴀᴍᴇ] - ᴀᴅᴅ ᴀ ᴜsᴇʀ ᴛᴏ ᴀᴜᴛʜ ʟɪsᴛ ᴏꜰ ᴛʜᴇ ɢʀᴏᴜᴘ.
/unauth [ᴜsᴇʀɴᴀᴍᴇ] - ʀᴇᴍᴏᴠᴇ ᴀ ᴜsᴇʀ ꜰʀᴏᴍ ᴀᴜᴛʜ ʟɪsᴛ ᴏꜰ ᴛʜᴇ ɢʀᴏᴜᴘ.
/authusers - ᴄʜᴇᴄᴋ ᴀᴜᴛʜ ʟɪsᴛ ᴏꜰ ᴛʜᴇ ɢʀᴏᴜᴘ."""


HELP_2 = """✅<u>__ᴘʟᴀʏ ᴄᴏᴍᴍᴀɴᴅs__:</u>

ᴄᴘʟᴀʏ ᴏʀ ᴄsᴛʀᴇᴀᴍ sᴛᴀɴᴅs ꜰᴏʀ ᴄʜᴀɴɴᴇʟ ᴘʟᴀʏ.
ᴠᴘʟᴀʏ sᴛᴀɴᴅs ꜰᴏʀ ᴠɪᴅᴇᴏ ᴘʟᴀʏ.

/play ᴏʀ /vplay ᴏʀ /cplay  - ʙᴏᴛ ᴡɪʟʟ sᴛᴀʀᴛ ᴘʟᴀʏɪɴɢ ʏᴏᴜʀ ɢɪᴠᴇɴ ǫᴜᴇʀʏ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ.

/stream ᴏʀ /cstream - sᴛʀᴇᴀᴍ ʟɪᴠᴇ ʟɪɴᴋs ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛs.

/channelplay [ᴄʜᴀᴛ ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ɪᴅ] ᴏʀ [ᴅɪsᴀʙʟᴇ] - ᴄᴏɴɴᴇᴄᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴀ ɢʀᴏᴜᴘ ᴀɴᴅ sᴛʀᴇᴀᴍ ᴍᴜsɪᴄ ᴏɴ ᴄʜᴀɴɴᴇʟ's ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ꜰʀᴏᴍ ʏᴏᴜʀ ɢʀᴏᴜᴘ.


✅<i>ʙᴏᴛ's sᴇʀᴠᴇʀ ᴘʟᴀʏʟɪsᴛs:</i>
/playlist - ᴄʜᴇᴄᴋ ʏᴏᴜʀ sᴀᴠᴇᴅ ᴘʟᴀʏʟɪsᴛ ᴏɴ sᴇʀᴠᴇʀs.
/deleteplaylist - ᴅᴇʟᴇᴛᴇ ᴀɴʏ sᴀᴠᴇᴅ ᴍᴜsɪᴄ ɪɴ ʏᴏᴜʀ ᴘʟᴀʏʟɪsᴛ
/play  - sᴛᴀʀᴛ ᴘʟᴀʏɪɴɢ ʏᴏᴜʀ sᴀᴠᴇᴅ ᴘʟᴀʏʟɪsᴛ ꜰʀᴏᴍ sᴇʀᴠᴇʀs."""


HELP_3 = """✅<u>__ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅs__:</u>

/stats - ɢᴇᴛ ᴛᴏᴘ 10 ᴛʀᴀᴄᴋs ɢʟᴏʙᴀʟ sᴛᴀᴛs, ᴛᴏᴘ 10 ᴜsᴇʀs ᴏꜰ ʙᴏᴛ, ᴛᴏᴘ 10 ᴄʜᴀᴛs ᴏɴ ʙᴏᴛ, ᴛᴏᴘ 10 ᴘʟᴀʏᴇᴅ ɪɴ ᴀ ᴄʜᴀᴛ ᴇᴛᴄ ᴇᴛᴄ.

/sudolist - ᴄʜᴇᴄᴋ sᴜᴅᴏ ᴜsᴇʀs ᴏꜰ ʏᴜᴋᴋɪ ᴍᴜsɪᴄ ʙᴏᴛ

/lyrics [ᴍᴜsɪᴄ ɴᴀᴍᴇ] - sᴇᴀʀᴄʜᴇs ʟʏʀɪᴄs ꜰᴏʀ ᴛʜᴇ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴍᴜsɪᴄ ᴏɴ ᴡᴇʙ.

/song [ᴛʀᴀᴄᴋ ɴᴀᴍᴇ] ᴏʀ [ʏᴛ ʟɪɴᴋ] - ᴅᴏᴡɴʟᴏᴀᴅ ᴀɴʏ ᴛʀᴀᴄᴋ ꜰʀᴏᴍ ʏᴏᴜᴛᴜʙᴇ ɪɴ ᴍᴘ3 ᴏʀ ᴍᴘ4 ꜰᴏʀᴍᴀᴛs.

C sᴛᴀɴᴅs ꜰᴏʀ ᴄʜᴀɴɴᴇʟ ᴘʟᴀʏ.
/queue ᴏʀ /cqueue - ᴄʜᴇᴄᴋ ǫᴜᴇᴜᴇ ʟɪsᴛ ᴏꜰ ᴍᴜsɪᴄ."""

HELP_4 = """✅<u>__ᴇxᴛʀᴀ  ᴄᴏᴍᴍᴀɴᴅs__:</u>
/start - sᴛᴀʀᴛ ᴛʜᴇ ᴍᴜsɪᴄ ʙᴏᴛ.
/help  - ɢᴇᴛ ᴄᴏᴍᴍᴀɴᴅs ʜᴇʟᴘᴇʀ ᴍᴇɴᴜ ᴡɪᴛʜ ᴅᴇᴛᴀɪʟᴇᴅ ᴇxᴘʟᴀɴᴀᴛɪᴏɴs ᴏꜰ ᴄᴏᴍᴍᴀɴᴅs.
/ping - ᴘɪɴɢ ᴛʜᴇ ʙᴏᴛ ᴀɴᴅ ᴄʜᴇᴄᴋ ʀᴀᴍ, ᴄᴘᴜ ᴇᴛᴄ sᴛᴀᴛs ᴏꜰ ʙᴏᴛ.

✅<i>ɢʀᴏᴜᴘ sᴇᴛᴛɪɴɢs:</i>
/settings - ɢᴇᴛ ᴀ ᴄᴏᴍᴘʟᴇᴛᴇ ɢʀᴏᴜᴘ's sᴇᴛᴛɪɴɢs ᴡɪᴛʜ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴs

🔗 ᴏᴘᴛɪᴏɴs ɪɴ sᴇᴛᴛɪɴɢs:

1. > ʏᴏᴜ ᴄᴀɴ sᴇᴛ ᴀᴜᴅɪᴏ ǫᴜᴀʟɪᴛʏ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ sᴛʀᴇᴀᴍ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ.

2. > ʏᴏᴜ ᴄᴀɴ sᴇᴛ ᴠɪᴅᴇᴏ ǫᴜᴀʟɪᴛʏ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ sᴛʀᴇᴀᴍ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ.

3. > ᴀᴜᴛʜ ᴜsᴇʀs:- ʏᴏᴜ ᴄᴀɴ ᴄʜᴀɴɢᴇ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs ᴍᴏᴅᴇ ꜰʀᴏᴍ ʜᴇʀᴇ ᴛᴏ ᴇᴠᴇʀʏᴏɴᴇ ᴏʀ ᴀᴅᴍɪɴs ᴏɴʟʏ. ɪꜰ ᴇᴠᴇʀʏᴏɴᴇ, ᴀɴʏᴏɴᴇ ᴘʀᴇsᴇɴᴛ ɪɴ ʏᴏᴜ ɢʀᴏᴜᴘ ᴡɪʟʟ ʙᴇ ᴀʙʟᴇ ᴛᴏ ᴜsᴇ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs(ʟɪᴋᴇ /sᴋɪᴘ, /sᴛᴏᴘ ᴇᴛᴄ)

4. > ᴄʟᴇᴀɴ ᴍᴏᴅᴇ: ᴡʜᴇɴ ᴇɴᴀʙʟᴇᴅ ᴅᴇʟᴇᴛᴇs ᴛʜᴇ ʙᴏᴛ's ᴍᴇssᴀɢᴇs ᴀꜰᴛᴇʀ 5 ᴍɪɴs ꜰʀᴏᴍ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛᴏ ᴍᴀᴋᴇ sᴜʀᴇ ʏᴏᴜʀ ᴄʜᴀᴛ ʀᴇᴍᴀɪɴs ᴄʟᴇᴀɴ ᴀɴᴅ ɢᴏᴏᴅ.

5. > ᴄᴏᴍᴍᴀɴᴅ ᴄʟᴇᴀɴ : ᴡʜᴇɴ ᴀᴄᴛɪᴠᴀᴛᴇᴅ, ʙᴏᴛ ᴡɪʟʟ ᴅᴇʟᴇᴛᴇ ɪᴛs ᴇxᴇᴄᴜᴛᴇᴅ ᴄᴏᴍᴍᴀɴᴅs (/ᴘʟᴀʏ, /ᴘᴀᴜsᴇ, /sʜᴜꜰꜰʟᴇ, /sᴛᴏᴘ ᴇᴛᴄ) ɪᴍᴍᴇᴅɪᴀᴛᴇʟʏ> ᴘʟᴀʏ sᴇᴛᴛɪɴɢs:

/playmode - ɢᴇᴛ ᴀ ᴄᴏᴍᴘʟᴇᴛᴇ ᴘʟᴀʏ sᴇᴛᴛɪɴɢs ᴘᴀɴᴇʟ ᴡɪᴛʜ ʙᴜᴛᴛᴏɴs ᴡʜᴇʀᴇ ʏᴏᴜ ᴄᴀɴ sᴇᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ's ᴘʟᴀʏ sᴇᴛᴛɪɴɢs. 

<i>ᴏᴘᴛɪᴏɴs ɪɴ ᴘʟᴀʏᴍᴏᴅᴇ:</i>

1. > sᴇᴀʀᴄʜ ᴍᴏᴅᴇ [ ᴅɪʀᴇᴄᴛ ᴏʀ ɪɴʟɪɴᴇ] - ᴄʜᴀɴɢᴇs ʏᴏᴜʀ sᴇᴀʀᴄʜ ᴍᴏᴅᴇ ᴡʜɪʟᴇ ʏᴏᴜ ɢɪᴠᴇ /ᴘʟᴀʏ ᴍᴏᴅᴇ. 

2. > ᴘʟᴀʏ ᴍᴏᴅᴇ [ ɢʀᴏᴜᴘ ᴏʀ ᴄʜᴀɴɴᴇʟ] - ᴄʜᴀɴɢᴇs ʏᴏᴜʀ ᴘʟᴀʏ ᴍᴏᴅᴇ ᴛᴏ ᴄʜᴀɴɴᴇʟ ᴏʀ ɢʀᴏᴜᴘ ᴀɴᴅ sᴛʀᴇᴀᴍs ᴍᴜsɪᴄ ᴛʜᴇʀᴇ ᴏɴʟʏ.

3. > ᴘʟᴀʏ ᴛʏᴘᴇ [ ᴇᴠᴇʀʏᴏɴᴇ ᴏʀ ᴀᴅᴍɪɴs] - ɪꜰ ᴀᴅᴍɪɴs, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴘʀᴇsᴇɴᴛ ɪɴ ɢʀᴏᴜᴘ ᴄᴀɴ ᴘʟᴀʏ ᴍᴜsɪᴄ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ."""

HELP_5 = """🔰<u>__ᴀᴅᴅ & ʀᴇᴍᴏᴠᴇ sᴜᴅᴏ ᴜsᴇʀs__:</u>
/addsudo [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ]
/rmsudo [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ]

🛃<i>ʜᴇʀᴏᴋᴜ:</i>
/usage - ᴅʏɴᴏ ᴜsᴀɢᴇ.

🌐<i>ᴄᴏɴꜰɪɢ ᴠᴀʀs:</i>
/get_var - ɢᴇᴛ ᴀ ᴄᴏɴꜰɪɢ ᴠᴀʀ ꜰʀᴏᴍ ʜᴇʀᴏᴋᴜ ᴏʀ .ᴇɴᴠ.
/del_var - ᴅᴇʟᴇᴛᴇ ᴀɴʏ ᴠᴀʀ ᴏɴ ʜᴇʀᴏᴋᴜ ᴏʀ .ᴇɴᴠ.
/set_var [ᴠᴀʀ ɴᴀᴍᴇ] [ᴠᴀʟᴜᴇ] - sᴇᴛ ᴀ ᴠᴀʀ ᴏʀ ᴜᴘᴅᴀᴛᴇ ᴀ ᴠᴀʀ ᴏɴ ʜᴇʀᴏᴋᴜ ᴏʀ .ᴇɴᴠ. sᴇᴘᴇʀᴀᴛᴇ ᴠᴀʀ ᴀɴᴅ ɪᴛs ᴠᴀʟᴜᴇ ᴡɪᴛʜ ᴀ sᴘᴀᴄᴇ.

🤖<i>ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅs:</i>
/restart - ʀᴇsᴛᴀʀᴛ ʙᴏᴛ. 
/update - ᴜᴘᴅᴀᴛᴇ ʙᴏᴛ.
/speedtest - ᴄʜᴇᴄᴋ sᴇʀᴠᴇʀ sᴘᴇᴇᴅs
/maintenance [ᴇɴᴀʙʟᴇ / ᴅɪsᴀʙʟᴇ] 
/logger [ᴇɴᴀʙʟᴇ / ᴅɪsᴀʙʟᴇ] - ʙᴏᴛ ʟᴏɢs ᴛʜᴇ sᴇᴀʀᴄʜᴇᴅ ǫᴜᴇʀɪᴇs ɪɴ ʟᴏɢɢᴇʀ ɢʀᴏᴜᴘ.
/get_log [ɴᴜᴍʙᴇʀ ᴏꜰ ʟɪɴᴇs] - ɢᴇᴛ ʟᴏɢ ᴏꜰ ʏᴏᴜʀ ʙᴏᴛ ꜰʀᴏᴍ ʜᴇʀᴏᴋᴜ ᴏʀ ᴠᴘs. ᴡᴏʀᴋs ꜰᴏʀ ʙᴏᴛʜ.

📈<i>sᴛᴀᴛs ᴄᴏᴍᴍᴀɴᴅs:</i>
/activevoice - ᴄʜᴇᴄᴋ ᴀᴄᴛɪᴠᴇ ᴠᴏɪᴄᴇ ᴄʜᴀᴛs ᴏɴ ʙᴏᴛ.
/activevideo - ᴄʜᴇᴄᴋ ᴀᴄᴛɪᴠᴇ ᴠɪᴅᴇᴏ ᴄᴀʟʟs ᴏɴ ʙᴏᴛ.
/stats - ᴄʜᴇᴄᴋ ʙᴏᴛs sᴛᴀᴛs

⚠️<i>ʙʟᴀᴄᴋʟɪsᴛ ᴄʜᴀᴛ ꜰᴜɴᴄᴛɪᴏɴ:</i>
/blacklistchat [ᴄʜᴀᴛ_ɪᴅ] - ʙʟᴀᴄᴋʟɪsᴛ ᴀɴʏ ᴄʜᴀᴛ ꜰʀᴏᴍ ᴜsɪɴɢ ᴍᴜsɪᴄ ʙᴏᴛ
/whitelistchat [ᴄʜᴀᴛ_ɪᴅ] - ᴡʜɪᴛᴇʟɪsᴛ ᴀɴʏ ʙʟᴀᴄᴋʟɪsᴛᴇᴅ ᴄʜᴀᴛ ꜰʀᴏᴍ ᴜsɪɴɢ ᴍᴜsɪᴄ ʙᴏᴛ
/blacklistedchat - ᴄʜᴇᴄᴋ ᴀʟʟ ʙʟᴀᴄᴋʟɪsᴛᴇᴅ ᴄʜᴀᴛs.

👤<i>ʙʟᴏᴄᴋᴇᴅ ꜰᴜɴᴄᴛɪᴏɴ:</i>
/block [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] - ᴘʀᴇᴠᴇɴᴛs ᴀ ᴜsᴇʀ ꜰʀᴏᴍ ᴜsɪɴɢ ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅs.
/unblock [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] - ʀᴇᴍᴏᴠᴇ ᴀ ᴜsᴇʀ ꜰʀᴏᴍ ʙᴏᴛ's ʙʟᴏᴄᴋᴇᴅ ʟɪsᴛ.
/blockedusers - ᴄʜᴇᴄᴋ ʙʟᴏᴄᴋᴇᴅ ᴜsᴇʀs ʟɪsᴛs

👤<i>ɢʙᴀɴ ꜰᴜɴᴄᴛɪᴏɴ:</i>
/gban [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] - ɢʙᴀɴ ᴀ ᴜsᴇʀ ꜰʀᴏᴍ ʙᴏᴛ's sᴇʀᴠᴇᴅ ᴄʜᴀᴛ ᴀɴᴅ sᴛᴏᴘ ʜɪᴍ ꜰʀᴏᴍ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ.
/ungban [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] - ʀᴇᴍᴏᴠᴇ ᴀ ᴜsᴇʀ ꜰʀᴏᴍ ʙᴏᴛ's ɢʙᴀɴɴᴇᴅ ʟɪsᴛ ᴀɴᴅ ᴀʟʟᴏᴡ ʜɪᴍ ꜰᴏʀ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ
/gbannedusers - ᴄʜᴇᴄᴋ ɢʙᴀɴɴᴇᴅ ᴜsᴇʀs ʟɪsᴛs

🎥<i>ᴠɪᴅᴇᴏᴄᴀʟʟs ꜰᴜɴᴄᴛɪᴏɴ:</i>
/set_video_limit [ɴᴜᴍʙᴇʀ ᴏꜰ ᴄʜᴀᴛs] - sᴇᴛ ᴀ ᴍᴀxɪᴍᴜᴍ ɴᴜᴍʙᴇʀ ᴏꜰ ᴄʜᴀᴛs ᴀʟʟᴏᴡᴇᴅ ꜰᴏʀ ᴠɪᴅᴇᴏ ᴄᴀʟʟs ᴀᴛ ᴀ ᴛɪᴍᴇ. ᴅᴇꜰᴀᴜʟᴛ ᴛᴏ 3 ᴄʜᴀᴛs.
/videomode [ᴅᴏᴡɴʟᴏᴀᴅ|ᴍ3ᴜ8] - ɪꜰ ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴏᴅᴇ ɪs ᴇɴᴀʙʟᴇᴅ, ʙᴏᴛ ᴡɪʟʟ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏs ɪɴsᴛᴇᴀᴅ ᴏꜰ ᴘʟᴀʏɪɴɢ ᴛʜᴇᴍ ɪɴ ᴍ3ᴜ8 ꜰᴏʀᴍ. ʙʏᴅᴇꜰᴀᴜʟᴛ ᴛᴏ ᴍ3ᴜ8. ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴏᴅᴇ ᴡʜᴇɴ ᴀɴʏ ǫᴜᴇʀʏ ᴅᴏᴇsɴᴛ ᴘʟᴀʏs ɪɴ ᴍ3ᴜ8 ᴍᴏᴅᴇ.

⚡️<i>ᴘʀɪᴠᴀᴛᴇ ʙᴏᴛ ꜰᴜɴᴄᴛɪᴏɴ:</i>
/authorize [ᴄʜᴀᴛ_ɪᴅ] - ᴀʟʟᴏᴡ ᴀ ᴄʜᴀᴛ ꜰᴏʀ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ.
/unauthorize [ᴄʜᴀᴛ_ɪᴅ] - ᴅɪsᴀʟʟᴏᴡ ᴀ ᴄʜᴀᴛ ꜰʀᴏᴍ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ.
/authorized - ᴄʜᴇᴄᴋ ᴀʟʟ ᴀʟʟᴏᴡᴇᴅ ᴄʜᴀᴛs ᴏꜰ ʏᴏᴜʀ ʙᴏᴛ.

🌐<i>ʙʀᴏᴀᴅᴄᴀsᴛ ꜰᴜɴᴄᴛɪᴏɴ:</i>
/broadcast [ᴍᴇssᴀɢᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ] - ʙʀᴏᴀᴅᴄᴀsᴛ ᴀɴʏ ᴍᴇssᴀɢᴇ ᴛᴏ ʙᴏᴛ's sᴇʀᴠᴇᴅ ᴄʜᴀᴛs.

<ᴜ>ᴏᴘᴛɪᴏɴs ꜰᴏʀ ʙʀᴏᴀᴅᴄᴀsᴛ:</ᴜ>
-**pin** : ᴛʜɪs ᴡɪʟʟ ᴘɪɴ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ 
-**pinloud** : ᴛʜɪs ᴡɪʟʟ ᴘɪɴ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ʟᴏᴜᴅ ɴᴏᴛɪꜰɪᴄᴀᴛɪᴏɴ
-**user** : ᴛʜɪs ᴡɪʟʟ ʙʀᴏᴀᴅᴄᴀsᴛ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴛʜᴇ ᴜsᴇʀs ᴡʜᴏ ʜᴀᴠᴇ sᴛᴀʀᴛᴇᴅ ʏᴏᴜʀ ʙᴏᴛ.
-**assistant** : ᴛʜɪs ᴡɪʟʟ ʙʀᴏᴀᴅᴄᴀsᴛ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ ꜰʀᴏᴍ ᴀssɪsᴛᴀɴᴛ ᴀᴄᴄᴏᴜɴᴛ ᴏꜰ ʏᴏᴜʀ ʙᴏᴛ.
-**nobot** : ᴛʜɪs ᴡɪʟʟ ꜰᴏʀᴄᴇ ʏᴏᴜʀ ʙᴏᴛ ᴛᴏ ɴᴏᴛ ʙʀᴏᴀᴅᴄᴀsᴛ ᴍᴇssᴀɢᴇ

<u>__ᴇxᴀᴍᴘʟᴇ__</u>:\n/broadcast -user -assistant -pin ʜᴇʟʟᴏ ᴛᴇsᴛɪɴɢ

"""
